In [2]:
import pandas as pd
print(pd.__version__)

2.0.3

In [5]:
new_s = pd.Series([12, 13 , 14, 15], index=['a', 'b', 'c', 'd'])
new_s

a    12
b    13
c    14
d    15
dtype: int64

In [17]:
drinks = ["Cold Coffee", "Hot Coffee", "Milk Tea", "Iced Tea"]
degree = [12, 77, 80, 5]
price = [ 200, 130, 333, 234]
data_frame = pd.DataFrame({"drinks": drinks,"degree" : degree,"price" : price},
                        columns= ["drinks", "degree", "price"],
                        index = range(1,5) )
data_frame

        drinks  degree  price
1  Cold Coffee      12    200
2   Hot Coffee      77    130
3     Milk Tea      80    333
4     Iced Tea       5    234

In [13]:
read_csv = pd.read_csv("annual.csv",low_memory = False )
read_csv.head(7)

,year,industry_code_ANZSIC,industry_name_ANZSIC,rme_size_grp,variable,value,unit
0,2011,A,"Agriculture, Forestry and Fishing",a_0,Activity unit,46134,COUNT
1,2011,A,"Agriculture, Forestry and Fishing",a_0,Rolling mean employees,0,COUNT
2,2011,A,"Agriculture, Forestry and Fishing",a_0,Salaries and wages paid,279,DOLLARS(millions)
3,2011,A,"Agriculture, Forestry and Fishing",a_0,"Sales, government funding, grants and subsidies",8187,DOLLARS(millions)
4,2011,A,"Agriculture, Forestry and Fishing",a_0,Total income,8866,DOLLARS(millions)
5,2011,A,"Agriculture, Forestry and Fishing",a_0,Total expenditure,7618,DOLLARS(millions)
6,2011,A,"Agriculture, Forestry and Fishing",a_0,Operating profit before tax,770,DOLLARS(millions)

In [34]:
read_csv.loc[read_csv["year"].argmax()]["year"]

2021

In [36]:
read_csv.iloc[[0,2],[2]]

                industry_name_ANZSIC
0  Agriculture, Forestry and Fishing
2  Agriculture, Forestry and Fishing

In [35]:
people = {
    'Name':['Suman', 'Help', 'BBC'],
    'Number':['123', '133', '223'],
    'Email':['abc@gmail.com', 'help@gmail.com', 'bbc@gmail.com']
    }
df = pd.DataFrame(people)

df.set_index("Email")

#filt = df(items ==['Name', 'Email'])
df.columns = ['first name', 'ph number', 'email']
df.columns = [x.lower() for x in df.columns]
df.columns = df.columns.str.replace(' ', '_')

df.rename(columns={'first_name': 'first', 'ph_number': 'number'}, inplace=True)
df['email'] = df['email'].str.upper()
df

   first number           email
0  Suman    123   ABC@GMAIL.COM
1   Help    133  HELP@GMAIL.COM
2    BBC    223   BBC@GMAIL.COM